import { defineStore } from 'pinia'
import { computed, reactive, watch } from 'vue'
import { v4 as uuid } from 'uuid'

export const useLearningStore = defineStore('learning', () => {
  const cards = reactive([
    {
      id: '1',
      level: 'C1',
      title: 'Konjunktiv I',
      description:
        "Кон'юнктив I - це один з часових способів в німецькій мові, який використовується для вираження нездійснених, умовних або фантастичних дій. Він використовується для створення умовних речень, вираження бажань або дій, які вважаються нереальними.",
      fullDescription:
        'Кон\'юнктив I - це один з часових способів в німецькій мові, який використовується для вираження нездійснених, умовних або фантастичних дій. Він використовується для створення умовних речень, вираження бажань або дій, які вважаються нереальними.<br><br> Кон\'юнктив I утворюється шляхом додавання закінчення до кореня дієслова. Закінчення для неправильних дієслів буде залежати від їх основи. Наприклад, для дієслова "sein" корінь "sei-" додається до закінчення.<br><br> Кон\'юнктив I використовується у реченнях умовного способу типу 1, коли умова є реальною або можливою. Наприклад: "Якщо буде сонце, я піду гуляти" (Wenn die Sonne scheint, gehe ich spazieren).<br><br> Також він використовується для вираження бажань, які можуть бути реалізовані. Наприклад: "Я бажаю, щоб ви отримали успіх" (Ich wünsche, dass ihr Erfolg habt).<br><br> Кон\'юнктив I також може використовуватися в косвенному мовленні для передачі чужих слів або думок. Наприклад: "Він сказав, що йому потрібна допомога" (Er sagte, dass er Hilfe brauche).<br><br> У практичному застосуванні кон\'юнктив I використовується для вираження умов, бажань та можливих подій, дозволяючи висловлювачу говорити про реальні або можливі речі.'
    },
    {
      id: '2',
      level: 'B2',
      title: 'Konjunktiv II',
      description:
        "Кон'юнктив II є одним з часових способів в німецькій мові, який використовується для вираження умовних, нездійснених або фантастичних дій. ",
      fullDescription:
        'Кон\'юнктив II є одним з часових способів в німецькій мові, який використовується для вираження умовних, нездійснених або фантастичних дій. Він використовується для створення гипотетичних ситуацій, вираження бажань, неможливості або нереальності подій.<br><br> Кон\'юнктив II утворюється шляхом додавання закінчення до кореня дієслова. Закінчення для неправильних дієслів буде залежати від їх основи. Наприклад, для дієслова "sein" корінь "wär-" додається до закінчення.<br><br> Кон\'юнктив II використовується в умовних реченнях типу 2, коли умова у минулому є нездійсненною або неправдивою. Наприклад: "Якби я був багатий, я купив би нову машину" (Wenn ich reich wäre, würde ich ein neues Auto kaufen).<br><br> Також він використовується для вираження бажань, які не можуть бути здійснені. Наприклад: "Я бажав би, щоб у мене був кришталевий шар" (Ich wünschte, ich hätte eine Kristallkugel).<br><br> Кон\'юнктив II також може використовуватися в косвенному мовленні для передачі тверджень, які були висловлені в кон\'юнктиві I. Наприклад: "Він сказав, що прийде, якби у нього був час" (Er sagte, er käme, wenn er Zeit hätte).<br><br> У практиці, кон\'юнктив II вживається у мовленні для вираження умов, бажань та нездійснених подій, дозволяючи висловлювачу говорити про те, що не є дійсністю.'
    },
    {
      id: '3',
      level: 'B1',
      title: 'Imperativ',
      description:
        'Імператив - це форма дієслова, яка використовується для вираження наказів, прохань, прохань або закликів. Він використовується для видачі прямих інструкцій або висловлювань, які передають бажання виконати певну дію.',
      fullDescription:
        'Імператив - це форма дієслова, яка використовується для вираження наказів, прохань, прохань або закликів. Він використовується для видачі прямих інструкцій або висловлювань, які передають бажання виконати певну дію.<br><br> Імператив утворюється шляхом використання основи дієслова без особових закінчень. Зазвичай в імперативі дієслово розміщується на початку речення, і може бути доповнене іншими словами або висловами, що додаються після нього.<br><br> Наприклад: <ul><li>"Відкрийте вікно!" (Öffnet das Fenster!) - наказ відкрити вікно.</li><li>"Будь ласка, прийдіть сюди" (Kommen Sie bitte hierher) - прохання прийти сюди.</li><li>"Не забудьте підписати документ" (Vergessen Sie nicht, das Dokument zu unterschreiben) - заклик не забувати підписати документ.</li></ul>Імператив також може використовуватися для вираження порад або рекомендацій:<ul><li>"Спробуйте цей новий рецепт" (Probiert dieses neue Rezept) - рекомендація спробувати новий рецепт.</li><li>"Зверніть увагу на дорожні знаки" (Achten Sie auf die Verkehrsschilder) - порада звернути увагу на дорожні знаки.</li></ul><br><br>У практичному застосуванні імператив використовується для видачі наказів, прохань, рекомендацій або порад, дозволяючи висловлювачу прямо вказувати на виконання певних дій.'
    },
    {
      id: '4',
      level: 'A1',
      title: 'Konjugation',
      description:
        "Кон'югація - це процес зміни дієслова в залежності від особи, числа, часу та способу в німецькій мові. Кон'югація відрізняється для кожної особи та числа, щоб виразити правильну форму дієслова в реченні.",
      fullDescription:
        "Кон'югація - це процес зміни дієслова в залежності від особи, числа, часу та способу в німецькій мові. Кон'югація відрізняється для кожної особи та числа, щоб виразити правильну форму дієслова в реченні.<br><br>Основа кон'югації дієслова зазвичай залежить від його закінчення. Таким чином, розрізняються три типи дієслів у німецькій мові: дієслова на -en, -eln та -ern. Нижче наведено приклади кон'югації для дієслова \"sprechen\" (говорити):</p><p>Präsens (теперішній час):</p><ul><li>Я говорю: ich spreche</li><li>Ти говориш: du sprichst</li><li>Він/вона/воно говорить: er/sie/es spricht</li><li>Ми говоримо: wir sprechen</li><li>Ви говорите: ihr sprecht</li><li>Вони говорять: sie sprechen</li></ul><p>Präteritum (минулий простий час):</p><ul><li>Я говорив/говорила: ich sprach</li><li>Ти говорив/говорила: du sprachst</li><li>Він/вона/воно говорив/говорила: er/sie/es sprach</li><li>Ми говорили: wir sprachen</li><li>Ви говорили: ihr spracht</li><li>Вони говорили: sie sprachen</li></ul><p>Кон'юнктив II:</p><ul><li>Я би говорив/говорила: ich spräche</li><li>Ти би говорив/говорила: du sprächest</li><li>Він/вона/воно би говорив/говорила: er/sie/es spräche</li><li>Ми би говорили: wir sprächen</li><li>Ви би говорили: ihr sprächt</li><li>Вони би говорили: sie sprächen</li></ul><p>Це лише приклади кон'югації для одного дієслова у різних часових формах та способах. В німецькій мові є багато інших дієслів із різними особами, числами та часами, які також потребують відповідної кон'югації.</p>"
    },
    {
      id: '5',
      level: 'A2',
      title: 'Reflexive Verben',
      description:
        'Reflexive Verben (рефлексивні дієслова) у німецькій мові вимагають використання займенників-вказівників "sich" для вираження того, що дія повертається до самого суб\'єкта.',
      fullDescription:
        '<p>Reflexive Verben (рефлексивні дієслова) у німецькій мові вимагають використання займенників-вказівників "sich" для вираження того, що дія повертається до самого суб\'єкта. Ці дієслова дозволяють описувати дії, які суб\'єкт виконує сам на себе.</p><p>Наприклад:</p><ul><li>Sich waschen (митися): Ich wasche mich. (Я миюся.)</li><li>Sich anziehen (одягатися): Er zieht sich an. (Він одягається.)</li><li>Sich freuen (радіти): Sie freut sich über das Geschenk. (Вона радіє подарунку.)</li></ul><p>У рефлексивних дієсловах зміна закінчень відбувається так само, як у звичайних дієсловах, але до основи додається займенник-вказівник "sich". Кон\'югація рефлексивних дієслів відбувається в залежності від особи та часу.</p><p>Презенс (теперішній час):</p><ul><li>Я миюся: Ich wasche mich.</li><li>Ти миєшся: Du wäschst dich.</li><li>Він/вона/воно миється: Er/Sie/Es wäscht sich.</li><li>Ми миємось: Wir waschen uns.</li><li>Ви миєтеся: Ihr wascht euch.</li><li>Вони миються: Sie waschen sich.</li></ul><p>Претеритум (минулий час):</p><ul><li>Я мився/милась: Ich wusch mich.</li><li>Ти мився/милась: Du wuschest dich.</li><li>Він/вона/воно мився/милась: Er/Sie/Es wusch sich.</li><li>Ми милися: Wir wuschen uns.</li><li>Ви милися: Ihr wuscht euch.</li><li>Вони милися: Sie wuschen sich.</li></ul><p>У рефлексивних дієсловах рефлексивний займенник "sich" може змінюватися залежно від особи та числа, так як інші займенники. Наприклад: "Ich wasche mich" (Я миюся), "Wir waschen uns" (Ми миємось).</p><p>Рефлексивні дієслова важливі для вираження різних дій та ді</p>'
    },
    {
      id: '6',
      level: 'A1',
      title: 'Artikel',
      description:
        'Статті (Artikel) в німецькій мові використовуються перед іменниками і вказують на їхню родову, числову та відмінкову форму. В німецькій мові є три типи статей: визначений (der, die, das), невизначений (ein, eine) та нульовий артикль.',
      fullDescription:
        '<p>Статті (Artikel) в німецькій мові використовуються перед іменниками і вказують на їхню родову, числову та відмінкову форму. В німецькій мові є три типи статей: визначений (der, die, das), невизначений (ein, eine) та нульовий артикль.</p><ol><li>Визначений артикль:<ul><li>der (чоловічий рід, однина): der Mann (чоловік)</li><li>die (жіночий рід, однина): die Frau (жінка)</li><li>das (середній рід, однина): das Kind (дитина)</li><li>die (множина): die Kinder (діти)</li></ul></li></ol><p>Визначений артикль використовується, коли ми говоримо про певну або відому особу, предмет або поняття. Наприклад: "Der Mann liest ein Buch." (Чоловік читає книгу.)</p><ol start="2"><li>Невизначений артикль:<ul><li>ein (чоловічий рід, однина): ein Mann (чоловік)</li><li>eine (жіночий рід, однина): eine Frau (жінка)</li><li>ein (середній рід, однина): ein Kind (дитина)</li><li>keine (множина): keine Kinder (діти)</li></ul></li></ol><p>Невизначений артикль використовується, коли ми говоримо про невизначену або невідому особу, предмет або поняття. Наприклад: "Ich habe ein Buch gekauft." (Я купив книгу.)</p><ol start="3"><li>Нульовий артикль:<ul><li>Відсутність артикля: Mann (чоловік), Frau (жінка), Kind (дитина), Kinder (діти)</li></ul></li></ol><p>Нульовий артикль використовується у випадках, коли не потрібно вказувати на наявність артикля перед іменником. Наприклад: "Frau liest ein Buch." (Жінка читає книгу.)</p><p>Статті в німецькій мові також змінюються залежно від роду, числа та відмінка іменника. Наприклад, визначений артикль "der" змінюється на "den" у давальному відмінку чоловічого роду: "Ich gebe dem Mann ein Buch."</p>'
    }
  ])

  // @ts-ignore
  const addedCards = reactive(JSON.parse(localStorage.getItem('addedCards')) || [])

  watch([addedCards, cards], () => {
    localStorage.setItem('addedCards', JSON.stringify(addedCards))
  })

  function addItem(id) {
    const card = get(id)

    if (card) addedCards.push(card)
  }

  function removeItem(id) {
    addedCards.splice(
      addedCards.findIndex((item) => item.id === id),
      1
    )
  }

  function toggleItem(id) {
    if (isAdded(id)) {
      console.log('remove')
      return removeItem(id)
    }

    console.log('add')
    addItem(id)
  }

  function isAdded(id) {
    return addedCards.find((card) => card.id === id) !== undefined
  }

  function get(id) {
    return cards.find((card) => card.id === id)
  }

  return {
    cards,
    addedCards,
    addItem,
    removeItem,
    get,
    toggleItem,
    isAdded
  }
})
